package com.company;

import java.util.Scanner;

import static java.lang.Double.parseDouble;

public class _01_DreamCar {
    public static void main(String[] args) {
        Scanner console = new Scanner(System.in);
        double N = Double.parseDouble(console.nextLine());
        double M = parseDouble(console.nextLine());
        double X = parseDouble(console.nextLine());
        double Y = parseDouble(console.nextLine());
        int T = Integer.parseInt(console.nextLine());

        System.out.println((T-1)*T*X/2.0 + T*(N - M) >= Y ? "Have a nice ride!" : "Work harder!");
    }
}
//•	На първият ред получаваме числото N – стартовата заплатата на Митко.
//•	На вторият ред получаваме числото M – месечните разходи на Митко.
//•	На третия ред получаваме числото X – сумата, с която всеки месец заплатата нараства.
//•	На четвъртия ред получаваме числото Y – цената на мечтания автомобил.
//•	На петия ред получаваме числото T – броят месеци, през които Митко е спестявал пари.

//•	100 - Числото N е реално число в интервала [10-10…100 000 000];
//•	 50 - Числото M е реално число в интервала [10-10…100 000 000];
//•	 10 - Числото X е реално число в интервала [10-10…100 000 000];
//•	500 - Числото Y е реално число в интервала [10-10…100 000 000];
//•	  7 - Числото T е цяло число в интервала [1…12 000 000 000];
//•	Позволено време: 0.100с
//•	Позволена памет: 16.00мб

//За седем месеца Митко ще е изкарал:
//100 + 110 + 120 + 130 + 140 + 150 + 160 = 910 лева
//За същия период той ще е похарчил:
//7 * 50 = 350 лева
//В края на краищата Митко е успял да спести:
//910 – 350 = 560 лева (които са достатъчни, за да си купи колата на стойност от 500 лева)